# English steno layout:
# # # # #     # # # # #
# X T P H  *  F P L T D
# S K W R     R B G S Z
# 
#      A O   E U

# Thai steno layout:
# # # # #     # # # # #
# ม ป พ ร  *  ร พ ป ม —
# ง ก ค ว     ว ค ก ง —
# 
#      ี ู   แ อ

KEYS = (
    '#',
    'ม-', 'ง-', 'ป-', 'ก-', 'พ-', 'ค-', 'ร-', 'ว-',
    'ี-', 'ู-',
    'A', '*',
    '-แ', '-อ',
    '-ร', '-ว', '-พ', '-ค', '-ป', '-ก', '-ม', '-ง', '-—'
)

IMPLICIT_HYPHEN_KEYS = ('ี-', 'ู-', '*', '-แ', '-อ', '5-', '0-')

SUFFIX_KEYS = ()

NUMBER_KEY = '#'

NUMBERS = {
    '-ร': '1-',
    '-พ': '2-',
    '-ป': '3-',
    '-ม': '4-',
    '-แ': '5-',
    '-อ': '0-',
    '-ว': '-6',
    '-ค': '-7',
    '-ก': '-8',
    '-ง': '-9',
}

UNDO_STROKE_STENO = '*'

ORTHOGRAPHY_RULES = []

ORTHOGRAPHY_RULES_ALIASES = {}

ORTHOGRAPHY_WORDLIST = None

KEYMAPS = {
    'Gemini PR': {
        '#'         : ('#1', '#2', '#3', '#4', '#5', '#6', '#7', '#8', '#9', '#A', '#B', '#C'),
        'ม-'        : 'S1-',
        'ง-'        : 'S2-',
        'ป-'        : 'T-',
        'ก-'        : 'K-',
        'พ-'        : 'P-',
        'ค-'        : 'W-',
        'ร-'        : 'H-',
        'ว-'        : 'R-',
        'ี-'        : 'A-',
        'ู-'        : 'O-',
        '*'         : ('*1', '*2', '*3', '*4'),
        '-แ'        : '-E',
        '-อ'        : '-U',
        '-ร'        : '-F',
        '-ว'        : '-R',
        '-พ'        : '-P',
        '-ค'        : '-B',
        '-ป'        : '-L',
        '-ก'        : '-G',
        '-ม'        : '-T',
        '-ง'        : '-S',
        '-—'        : ('-D', '-Z'),
        'no-op'     : ('Fn', 'pwr', 'res1', 'res2'),
    },
    'Keyboard': {
        '#'         : ('1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '='),
        'ม-'        : 'q',
        'ง-'        : 'a',
        'ป-'        : 'w',
        'ก-'        : 's',
        'พ-'        : 'e',
        'ค-'        : 'd',
        'ร-'        : 'r',
        'ว-'        : 'f',
        'ี-'        : 'c',
        'ู-'        : 'v',
        'A'         : ('t', 'g'),
        '*'         : ('y', 'h'),
        '-แ'        : 'n',
        '-อ'        : 'm',
        '-ร'        : 'u',
        '-ว'        : 'j',
        '-พ'        : 'i',
        '-ค'        : 'k',
        '-ป'        : 'o',
        '-ก'        : 'l',
        '-ม'        : 'p',
        '-ง'        : ';',
        '-—'        : ('[', '\''),
        'arpeggiate': 'space',
        # Suppress adjacent keys to prevent miss-strokes.
        'no-op'     : ('z', 'x', 'b', ',', '.', '/', ']', '\\'),
    },
    'Passport': {
        '#'    : '#',
        'ม-'   : 'S',
        'ง-'   : 'C',
        'ป-'   : 'T',
        'ก-'   : 'K',
        'พ-'   : 'P',
        'ค-'   : 'W',
        'ร-'   : 'H',
        'ว-'   : 'R',
        'ี-'   : 'A',
        'ู-'   : 'O',
        '*'    : ('~', '*'),
        '-แ'   : 'E',
        '-อ'   : 'U',
        '-ร'   : 'F',
        '-ว'   : 'Q',
        '-พ'   : 'N',
        '-ค'   : 'B',
        '-ป'   : 'L',
        '-ก'   : 'G',
        '-ม'   : 'Y',
        '-ง'   : 'X',
        '-—'   : ('D', 'Z'),
        'A': ('!', '^', '+'),
    },
    'Stentura': {
        '#'    : '#',
        'ม-'   : '^',
        'ง-'   : 'S-',
        'ป-'   : 'T-',
        'ก-'   : 'K-',
        'พ-'   : 'P-',
        'ค-'   : 'W-',
        'ร-'   : 'H-',
        'ว-'   : 'R-',
        'ี-'   : 'A-',
        'ู-'   : 'O-',
        '*'    : '*',
        '-แ'   : '-E',
        '-อ'   : '-U',
        '-ร'   : '-F',
        '-ว'   : '-R',
        '-พ'   : '-P',
        '-ค'   : '-B',
        '-ป'   : '-L',
        '-ก'   : '-G',
        '-ม'   : '-T',
        '-ง'   : '-S',
        '-—'   : ('-D', '-Z')
    },
    'TX Bolt': {
        # Can we distinguish between upper and lower S for this machine?
        '#'    : '#',
        'ง-'   : 'S-',
        'ป-'   : 'T-',
        'ก-'   : 'K-',
        'พ-'   : 'P-',
        'ค-'   : 'W-',
        'ร-'   : 'H-',
        'ว-'   : 'R-',
        'ี-'   : 'A-',
        'ู-'   : 'O-',
        '*'    : '*',
        '-แ'   : '-E',
        '-อ'   : '-U',
        '-ร'   : '-F',
        '-ว'   : '-R',
        '-พ'   : '-P',
        '-ค'   : '-B',
        '-ป'   : '-L',
        '-ก'   : '-G',
        '-ม'   : '-T',
        '-ง'   : '-S',
        '-—'   : ('-D', '-Z')
    },
    'Treal': {
        '#'    : ('#1', '#2', '#3', '#4', '#5', '#6', '#7', '#8', '#9', '#A', '#B'),
        'ม-'   : 'S1-',
        'ง-'   : 'S2-',
        'ป-'   : 'T-',
        'ก-'   : 'K-',
        'พ-'   : 'P-',
        'ค-'   : 'W-',
        'ร-'   : 'H-',
        'ว-'   : 'R-',
        'ี-'   : 'A-',
        'ู-'   : 'O-',
        '*'    : ('*1', '*2'),
        '-แ'   : '-E',
        '-อ'   : '-U',
        '-ร'   : '-F',
        '-ว'   : '-R',
        '-พ'   : '-P',
        '-ค'   : '-B',
        '-ป'   : '-L',
        '-ก'   : '-G',
        '-ม'   : '-T',
        '-ง'   : '-S',
        '-—'   : ('-D', '-Z'),
        'A': ('X1-', 'X2-', 'X3')
    },
}

DICTIONARIES_ROOT = 'asset:plover_thsteno:dicts'
DEFAULT_DICTIONARIES = ('thsteno_main.json','thsteno_base.py')
